This document is for collecting and sketching ideas, it is not meant
to be a user friendly tutorial. There might be inconsistencies,
unfinished work, bugs and other dragons.

This is a literate programming document, for interactive use with
Emacs and Org mode.

* Test if Overtone works

  #+BEGIN_SRC clojure
  (use 'overtone.live)
  (demo (sin-osc))
  #+END_SRC

  #+RESULTS:
  : nil#<synth-node[loading]: user/audition-synth 59>

* Playing Piano
  Use the overtone piano instrument:
  #+BEGIN_SRC clojure
  (use 'overtone.inst.piano)
  #+END_SRC

  #+RESULTS:
  : nil

  #+BEGIN_SRC clojure
  ; play the MIDI note 60 (C4)
  (piano 60)

  ; play an Am chord
  (doseq [note (chord :A3 :minor)] (piano note))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: overtone.inst.piano/piano 55>nil

  Chords are a vector of notes:
  #+BEGIN_SRC clojure
  (chord :A3 :minor) ; => [57 64 60]
  #+END_SRC

*** Sine waves
    All sounds can be described as combinations of sine waves
    ([[https://en.wikipedia.org/wiki/Fourier_series][Fourier Series]], don't worry, you don't need to understand the
    math).
    A simple, single sine wave is the most "clean"
    sound. Here is how it sounds:
    #+BEGIN_SRC clojure
    (demo (sin-osc))
    #+END_SRC

    #+RESULTS:
    : #<synth-node[loading]: user/audition-synth 32>

*** Additive vs. Subtractive Synthesis
    As we have seem, we can build different sounds by adding more an
    more sine waves. This is called additive synthesis and it is a
    feasible way to build synthesizers.

    However, there is another way: "Subtractive Sound Design" which
    means we start with a signal that is rich in different frequencies
    (composed of many waves) and then we subtract certain parts of it,
    to shape its sound.
    Subtractive sound design is considered to be easier and it's a bit
    more common than additive synthesis.

    Here, we go, let us do some subtractive synthesis now. First we
    want a signal that is very rich, so we can subtract from it.
    #+BEGIN_SRC clojure
    (demo (white-noise))
    #+END_SRC
    Awesome, we got noise! How could that be any good? Well as it
    turns out, [[https://en.wikipedia.org/wiki/White_noise][white noise]] is just a random distribution of
    frequencies with a flat spectrum. Simplified it just means, that
    every frequency has the same probability of occuring the the
    sound or that it contains all frequencies.
    There are other "colors" of noises too, which have other
    distributions of frequencies and are available in Overtone, too.


    So, with white noise we have a signal that is rich in every
    frequency in the range, that can be perceived by humans. From this
    signal we are going to subtract something to give it a different
    sound:

    #+BEGIN_SRC clojure
    (let [num-tones 50
          rnd-tone (fn [] (sin-osc (+ 200 (rand-int 800))))
          tones (repeatedly num-tones rnd-tone)]
      (demo (- (white-noise) (apply + tones))))


    #+END_SRC

    #+RESULTS:
    : #<synth-node[loading]: user/audition-synth 81>

    Hm, okay this probably does not sound to great. The thing is, our
    white noise signal is so rich, that we would need to
    subtract many, many frequencies and it's hard to predict what the
    sound will be like.
    Also be a bit cautious with adding more tones to be subtracted,
    a few hundred tones can put quite some pressure on your computer.

    Later we will learn more powerful approaches for subtractive synthesis.

    Instead of white noise, let us try another signal to start with:

    #+BEGIN_SRC clojure
    (demo (lf-pulse:ar 200)) ; pulse or rectangle wave

    (demo (lf-tri 200)) ; triangle wave

    (demo (lf-saw 200)) ; sawtooth wave
    #+END_SRC

    #+RESULTS:
    : #<synth-node[loading]: user/audition-synth 834>#<synth-node[loading]: user/audition-synth 835>#<synth-node[loading]: user/audition-synth 836>

    Composing these oscillators give some interesting results more
    quickly than starting out with white noise and simple sines:

    #+BEGIN_SRC clojure
    (let [tri (lf-tri 180)
          sin (sin-osc 80)
          tri-high (lf-tri 300)]
      (demo (+ (- (lf-saw 200)
                  tri
                  sin)
               tri-high)))
    #+END_SRC

    #+RESULTS:
    : #<synth-node[loading]: user/audition-synth 839>

